'''Вычислить число π c заданной точностью d
Пример:
- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
Метод Лейбница
Лейбниц получил очень простое выражение для PI, а именно:
π/4 = 1 - 1/3 + 1/5 - 1/7 + 1/9 - 1/10 и т.д.
или, после умножения на 4:
π = 4 - 4/3 + 4/5 - 4/7 + 4/9 - 4/10 и т.д.
Просуммируйте этот ряд и Вы получите число π (PI). 
'''
print('Вычислить число π c заданной точностью d. Поэтому для точности числа π (PI) в 2 знака введите 0.01 и т.д.')
d = input('Введите точность для числа π (PI): ')

k = 1                          # Начальный делитель

summa = 0                      #Начальная сумма
for i in range (10000):        #Значение кол-ва итераций оптимально по точности и скорости выполнения
# когда шаг положителен 
    if i % 2 == 0:
        summa += 4/k
    else:
# когда шаг отрицателен
        summa -= 4/k
    k += 2                     # шаг делителя

template = '{:.' + str(str(d)[::-1].find('.')) + 'f}' #Формирование значения числа  π (PI) c заданной точностью d
print(template.format(summa))