'''Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл 
(не пишем в файл!) многочлен степени k.
Пример:
- k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0'''
'''Нагляднее выбрать значения коэффициентов с меньшим интервалом например (0,5), но в условии написано 'значения от 0 до 100' '''

from random import randint

stepK = int(input('Задайте натуральную степень k: '))
lst = [randint(0, 100) for i in range(stepK+1)]             # Формируем псевдослучайным образом коэффициенты для многочлена (кол-во зависит от степени k)

print('Сформированные случайным образом коэффициенты')
print(lst)

lst2 = list(reversed(lst))                                # Переворачиваем список коэффициентов

#x ='x'
stringR =''                                               # Инициализируем нашу строку под многочлен
stepKK = stepK                                            # Запоминаем степень многочлена

for i in range(len(lst2)-1,-1,-1):                        # Формируем многочлен справа налево
    if (i == 0):
        str1 = str(lst2[i])+' = 0'
    if (i > 0) and (lst2[i]!=0):
        str1 = str(lst2[i])+'*x^'+str(stepKK)+' + '
        stepKK -=1
    if (i == len(lst2)-1) and (lst2[i]!=0):
        str1 = str(lst2[i])+'*x^'+str(stepK)+' + '
    if (lst2[i]==0) and (i != 0):
        str1 = "K"                                        # Заменяем нулевые "0" коэффициенты на букву K (для более простого удаления)
        stepKK -=1
    stringR += str1                                       # Шаг за шагом формируем многочлен

# Удаляем ненужные коэффициенты - 1, удаляем Х с коэффициентом 0, Х^1 заменяем на Х, убираем 0
stringRes1 = stringR.replace("K", "", len(lst2)).replace("+ 1*x", "+ x", len(lst2)).replace("x^1 +", "x +", len(lst2)).replace("+ 0*x", "", len(lst2)).replace("+ 0 =", "=", len(lst2))

print(stringRes1)