'''Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
Простые числа от 0 до 1000 Пример:
[1, 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 
151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257,  263, 269, 271, 277, 281, 283, 293, 307, 311, 
313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 
499, 503, 509, 521, 523, 541, 547, 557, 563, 569, 571, 577, 587, 593, 599, 601, 607, 613, 617, 619, 631, 641, 643, 647, 653, 659, 661, 673, 677, 
683, 691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811, 821, 823, 827, 829, 839, 853, 857, 859, 863, 877, 881, 
883, 887, 907, 911, 919, 929, 937, 941, 947, 953, 967, 971, 977, 983, 991, 997]'''

'''Программа находит как список (уникальных) простых чисел в вводимом числе. Так и произведение простых чисел (цифр)
 Наприме для 45. Это списки: [3, 5] и [3, 3, 5] соответственно. ! Начинает подтормаживать после 35000 ! При 100000 и более - висит''' 

number = int(input('Введите число натуральное число (числа, возникающие естественным образом при счёте (1, 2, 3, 4, 5, 6, 7 и так далее): '))
number2 = number
chisla = []
delitel = []
pdel = []

for num in range(2,number + 1):                            # Нахождение всех простых чисел меньше введенного пользователем
      if num > 1:
              for i in range(2,num):
                      if (num % i) == 0:
                              break
              else:
                      chisla.append(num)

for i in range(0,len(chisla)-1):                           # Нахождение списка простых чисел (уникальное вхождение)
    if number%chisla[i] == 0:
        delitel.append(chisla[i])
    if (number == chisla[len(chisla)-1]):
           print('Число', number, 'само является простым, т.е. делится только само на себя и на 1')
           exit()

mnozh = 1
j=0
i=0
while number//mnozh !=1:                                   # Нахождение списка (произведения простых чисел), которое даст число введеное пользователем

    while number%chisla[j] ==0:
          number = number/chisla[j]
          pdel.append(chisla[j])
    i+=1
    j+=1 

print('Список простых множителей числа (без повторений)',delitel)
print('Список простых множителей числа',number2, 'это произведение', pdel)