'''Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.'''
'''Вариант 2. Решение, когда остаются только элементы, которые не повторялись в исходном списке
Например [1, 2, 3, 4, 3, 2, 1]  -  {4};  [1, 1, 2, 0, -1, 3, 4, 4] - {0, 2, 3, -1}'''

s = input('Введите элемента списка через пробел: ')
inputList = list(map(int, s.split()))
print(inputList)
inputList.sort()                                        # Сортировка введенного списка
countList = []
for i in range(0, len(inputList)-1):                    # Формирование списка countList
    if inputList[i] == inputList[i+1]: 

        countList.append(inputList[i])
        countList.append(inputList[i+1])

del1 = set(countList)                                   # Создание множества del1 
ost = set(inputList)                                    # Создание множества ost

print('Cписок неповторяющихся элементов исходной последовательности будет равен', ost-del1) # Формирование искомого списка вычитанием из ost - del1
